Revit 2026 API

# MasonryCMUMasonryCMUType Property

---

The property labeled "Type" from the "MasonryCMU" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MasonryCMUType { get; }
```
```vb
Public Shared ReadOnly Property MasonryCMUType As String
	Get
```
```cpp
public:
static property String^ MasonryCMUType {
	String^ get ();
}
```
```fsharp
static member MasonryCMUType : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MasonryCMUType".

#### Reference

MasonryCMU Class

Autodesk.Revit.DB.Visual Namespace